Revit 2024 API
BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property
 There is only one component in this repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater { get; }
Visual Basic
Public Shared ReadOnly Property ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace